# Pandas Basics - 2

In [3]:
import numpy as np
import pandas as pd

In [5]:
user_data={
    "MarksA":np.random.randint(1,100,5),
    "MarksB":np.random.randint(50,100,5),
    "MarksC":np.random.randint(1,100,5)
}
df = pd.DataFrame(user_data)
df

   MarksA  MarksB  MarksC
0      72      58      28
1      92      51      94
2      40      82      28
3      50      86      11
4      30      93      29

In [7]:
#to get summary of dataframe
df.describe()

          MarksA     MarksB    MarksC
count   5.000000   5.000000   5.00000
mean   56.800000  74.000000  38.00000
std    25.083859  18.398369  32.19472
min    30.000000  51.000000  11.00000
25%    40.000000  58.000000  28.00000
50%    50.000000  82.000000  28.00000
75%    72.000000  86.000000  29.00000
max    92.000000  93.000000  94.00000

In [9]:
# to get rows starting from last row
df.tail(n=3)

   MarksA  MarksB  MarksC
2      40      82      28
3      50      86      11
4      30      93      29

In [11]:
# get a row
df.iloc[2]

MarksA    40
MarksB    82
MarksC    28
Name: 2, dtype: int32

In [14]:
# row and col
df.iloc[2,1]

82

In [16]:
# if we dont know which is column number
col_idx=df.columns.get_loc('MarksB')
print(col_idx)
df.iloc[2,col_idx]

1

82

In [23]:
# finding more than one column number
col_idx=[df.columns.get_loc('MarksB'),df.columns.get_loc('MarksC')]
print(col_idx)
df.iloc[2,col_idx]

[1, 2]

MarksB    82
MarksC    28
Name: 2, dtype: int32

In [25]:
#slicing rows
df.iloc[:3,col_idx]

   MarksB  MarksC
0      58      28
1      51      94
2      82      28

In [26]:
#sort values
df.sort_values(by=["MarksA"],ascending=True)

   MarksA  MarksB  MarksC
4      30      93      29
2      40      82      28
3      50      86      11
0      72      58      28
1      92      51      94

In [27]:
#sort values
df.sort_values(by=["MarksA"],ascending=False)

   MarksA  MarksB  MarksC
1      92      51      94
0      72      58      28
3      50      86      11
2      40      82      28
4      30      93      29

In [30]:
#convert df to array
data_array = df.values
data_array
print(type(data_array))

<class 'numpy.ndarray'>

In [32]:
# conver array to df
new_df = pd.DataFrame(data_array,dtype='int32',columns=['phy','chem','Math'])
print(new_df)

   phy  chem  Math
0   72    58    28
1   92    51    94
2   40    82    28
3   50    86    11
4   30    93    29

# storing in CSV

In [40]:
new_df.to_csv('PCM.csv',index=False)

# read from CSV

In [41]:
pcm = pd.read_csv('PCM.csv')
pcm

   phy  chem  Math
0   72    58    28
1   92    51    94
2   40    82    28
3   50    86    11
4   30    93    29